{
  "title": "Royer Gómez",
  "skills": {
    "title": "Habilidades",
    "backend": {
      "label": "Desarrollo backend",
      "value": "| Java • Python • Express • NodeJs"
    },
    "ci/cd": {
      "label": "CI/CD",
      "value": "| Jenkins • Github Actions • Bash"
    },
    "miscellaneous": {
      "label": "Misceláneos",
      "value": "| Azure • MySQL • Machine Learning • MongoDB • Docker"
    },
    "scripting": {
      "label": "Scripting",
      "value": "| Bash • Python"
    },
    "frontend": {
      "label": "Desarrollo frontend",
      "value": "| ReactJs/NextJs • VueJs/Nuxt • JavaScript • Html • CSS"
    },
    "soft": {
      "label": "Habilidades blandas",
      "value": "| Team player • Bias for action • Deliver results"
    }
  },
  "experiences": {
    "title": "Experiencia",
    "job2": {
      "company": "Ministerio de hacienda",
      "skills": "| Java • Jenkins • VueJs • Nginx * Docker",
      "role": "Devops Engineer | Oct 2021 - Present, Santo Domingo, RD",
      "exp": {
        "1": {
          "label": "Automatización de procesos, estructura CI/CD y reducción de errores",
          "content1": "Hemos trabajado de la mano con el equipo de desarrollo y el equipo de Infraestructura de TI en la definición de los procesos de CI/CD y en la comprensión general de la ingeniería y la codificación.",
          "content2": "Mejoramos la implementación de la estrategia DevOps existente, reduciendo así el consumo de recursos y mejorando significativamente el tiempo de implementación. Pasamos de una estrategia monolítica a una estrategia integral para los procesos de CI/CD, lo que resultó en una mejor comprensión por parte del personal técnico.",
          "content3": "Implementamos los procesos de build, test y deployment utilizando Jenkins y Docker, lo que nos permitió una entrega continua ordenada y mayor agilidad."
        },
        "2": {
          "label": "Cambios culturales",
          "content1": "Presentamos al personal la cultura de DevOps, lo que implicó una mejor comprensión de las responsabilidades individuales y la estructura organizacional. Además, instruimos al personal mediante talleres sobre temas relacionados con la cultura de DevOps.",
          "content2": "Creamos diferentes productos internos que tenían como objetivo ayudar a los desarrolladores y analistas en sus tareas técnicas. Muchos de los productos tenían como objetivo guiar al personal de TI en sus tareas diarias, dándoles más independencia de los procesos burocráticos, haciendo transparentes los procesos de CI/CD de las aplicaciones y permitiendo una mayor supervisión de los sistemas implementados en el entorno de desarrollo y pruebas.",
          "content3": "Creación de scripts y herramientas personalizados para automatizar tareas repetitivas y liberar tiempo para actividades de mayor valor."
        },
        "3": {
          "label": "Aportes en otras areas",
          "content1": "También tuve un rol importante como Frontend Developer, responsable de diseñar y desarrollar interfaces de usuario altamente interactivas utilizando Vue.js. Trabajé en estrecha colaboración con equipos de Backend, desarrollados en Java, para crear aplicaciones web escalables y robustas.",
          "content2": "Nuestra metodología de trabajo se basó en Scrum, lo que nos permitió entregar valor de manera incremental y adaptarnos a los cambios de manera ágil. Utilizamos Jira para gestionar el product backlog, hacer seguimiento de las tareas y colaborar de manera efectiva dentro del equipo."
        }
      },
      "job1": {
        "company": "Media Revolution",
        "skills": "| NodeJs • PostgresSQL • Typescript • ReactJs",
        "role": "Fullstack Developer | Jul 2019 - Oct 2021, Santo Domingo, RD",
        "exp": {
          "1": {
            "content1": "Hemos trabajado de la mano con el equipo de desarrollo y el equipo de Infraestructura TI en la definición de los procesos de CI/CD y en el entendimiento general de la ingeniería y codificación.",
            "content2": "Mejoramos la implementación de la estrategia DevOps existente, reduciendo así el consumo de recursos y mejorando significativamente el tiempo de implementación. Pasamos de una estrategia monolítica a una estrategia integral de procesos de CI/CD, lo que resultó en un mejor entendimiento por parte del personal técnico"
          }
        }
      }
    },
    "education": {
      "title": "Educación",
      "1": {
        "institution": "Universidad Acción Pro Educación y Cultura (UNAPEC)",
        "mode": "B.S.Software Engineering | Santo Domingo, RD."
      }
    },
    "coursework": {
      "title": "Trabajo de curso",
      "Data Structures and Algorithms": "Data Structures and Algorithms",
      "Developing Android Apps": "Developing Android Apps",
      "Machine Learning": "Machine Learning",
      "Data Mining": "Data Mining",
      "Applied Statistics": "Applied Statistics",
      "Linear Algebra": "Linear Algebra",
      "Differential Equation": "Differential Equation"
    },
    "interest": {
      "title": "Intereses",
      "value": "Viajar • Fitness • Nutrición"
    }
  }
}
